app/Controllers/MahasiswaController.php

SELECT *
FROM `mahasiswa`
---
    public function index()
    {
        $mahasiswaModel = new Mahasiswa();
        $mahasiswa = $mahasiswaModel->findAll();

SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id` = '2'
---
    public function edit($id){
        $mahasiswaModel = new Mahasiswa();
        $mahasiswa = $mahasiswaModel->find($id);